[
    {
        "HSI: Визуализация": "Просмотр каналов и индексов HSI через 'умную строку'. Гистограмма отображает статистику полученного изображения. При клике на любой пиксель можно посмотреть его спектральную сигнатуру и производную, для них также находится статистика."
    },
    {
        "Матрица корреляции": "Данный раздел предназначен для поиска статистических величин, извлекаемых из всего кубика HSI. Корреляция (Пирсона) вычисляется между каждой парой каналов, а полученные значения складываются в таблицу (матрица корреляции) и отображаются в виде тепловой карты. Каждый пиксель данной матрицы содержит значение корреляции между какой-либо парой каналов.",
        "Линейная регрессия": "При клике на любой пиксель строится модель линейной регрессии - строится график зависимости точек одного канала от другого, которые аппроксимируются прямой 'y = ax + b'. Чем выше коэффициент корреляции по модулю, тем лучше прямая иллюстрирует функциональную зависимость (т.е лучше совпадает с точками). Для данного рода зависимости также находятся следующие стат. величины: коэффициент детерминации, средняя эластичность и бета-коэффициент.",
        "Статистика каналов": "Также можно получить статистику как для всего HSI, так и для каждого из каналов в отдельности - в последнем случае она представляется в виде графика. Например если выбрать 'Максимум по каналам', то по каждому каналу HSI будет вычислено максимальное значение (204 значения всего), и мы получим график зависимости максимума от канала."
    },
    {
        "Термальные изображения": "Здесь будет что-то про TIR и флуоресценцию"
    },
    {
        "Спектральная классификация": "Данный раздел включает в себя классические методы классификации спектров, такие как Spectral Angle Mapper (SAM), Spectral Information Divergence (SID) и Spectral Correlation Angle (SCA). Данные методы используются для нахождения спектров, наиболее похожих на заданный. Для каждого спектра, который мы принимаем за класс, HSI преобразуется в спектральный индекс, каждый пиксель которого измеряет его схожесть с классом. После этого, обычно, наиболее схожие пиксели отделяют по порогу, и говорят, что они и исходный спектр одного класса, однако в данном разделе вычисляется только спектральный индекс, поскольку он может быть наиболее полезен.",
        "Использование": "При нажатии на любой пиксель изображения, он выбирается в качестве класса, после чего применяется выбранный метод классификации, и отображается спектральная карта схожести. Для SAM и SID чем меньше значение в пикселе, тем выше схожесть; для SCA - наоборот (т.к вычисляется корреляция между спектрами)."
    },
    {
        "Извлечение чистых спектров": "Существуют спектральные алгоритмы, которые позволяют автоматически находить классы в HSI, некоторые из них реализованы в данном разделе. Одна группа алгоритмов отвечает за выбор спектров, которые и будут являться классами, а вторая группа - за преобразование HSI в набор спектральных индексов (карты изобилия), показывающих содержание каждого из найденных классов в каждом пикселе (спектре) HSI. Чтобы воспользоваться данным функционалом, необходимо выбрать алгоритм из каждой группы и ввести количество искомых классов."
    },
    {
        "Кластеризация": "HSI можно разделить на классы автоматическим образом с помощью стандартных инструментов машинного обучения. Выбрав метод и количество классов (N), которые необходимо найти автоматически, каждый пиксель HSI будет пронумерован одним из N классов, после чего результат отобразится в виде тепловой карты."
    }
]